-- +goose Up
-- +goose StatementBegin
SELECT 'up SQL query';
-- +goose StatementEnd
INSERT INTO Vacation(start_date,end_date,total_cost,name,ColleagueId)
VALUES('2023-06-14','2023-06-18','400.0$','5 дней в Костроме',1),
('2023-07-23','2023-07-28','700.0$','Нальчик - лучшие моменты',2),
('2023-08-20','2023-08-28','1799.0$','Тула - от пива до пряников',3),
('2023-09-01','2023-09-09','100.0$','Липецкая стекловата',4),
('2023-07-16','2023-07-20','300.0$','Воды кубани',1),
('2023-03-25','2023-04-06','726.0$','Кемерововский санаторий',2),
('2023-02-01','2023-02-15','1000.0$','Полярная ночь в Мурманске',3),
('2023-06-14','2023-06-20','2136.0$','Молочное небо в Санкт-Петербург',4),
('2023-10-21','2023-10-25','120.0$','По Новороссийску с любовью',2),
('2023-05-04','2023-05-14','2689.0$','Камчатка - прекрасный мир морской кулинарии',3),
('2023-08-25','2023-09-11','1340.0$','Депутатск - руины горного дела',4),
('2023-02-04','2023-02-09','874.0$','Горные просторы Кисловодска',1),
('2023-08-01','2023-08-15','964.0$','Необъятный океан Владивостока',2),
('2023-11-10','2023-11-17','1727.0$','Просторные поля Алтайского края',3),
('2024-01-01','2024-01-20','3424.0$','Новый год в КНДР',4);
-- +goose Down
-- +goose StatementBegin
SELECT 'down SQL query';
-- +goose StatementEnd
